# Пользователь вводит число N – общее количество
# рассматриваемых дней (1 ≤ N ≤ 100). В следующих строках
# располагается N целых чисел.
# Каждое число – среднесуточная температура в
# соответствующий день. Температуры – целые числа и лежат в
# диапазоне от –50 до 50
# Input: 6 -> -20 30 -40 50 10 -10
# # Output: 2


# count = 0
# max = 0

# n = int(input('Input of quantity of days: '))
# for dayCount in range(n): # range - промежуток
#     day = int(input('Input a temperature of a day: '))
#     if day > 0:
#         count += 1
#     else :
#         if count >= max :
#             max = count
#             count = 0
#     # elif count > max :
#         # max = count 
# if count > max :
#     max = count
# print('Max quantity of warm days is ', max)

# ===================================================================================================

# По данному целому неотрицательному n вычислите
# значение n!. N! = 1 * 2 * 3 * … * N (произведение всех
# чисел от 1 до N) 0! = 1 Решить задачу используя цикл
# while
# Input: 5
# Output: 120 

# n = int(input('Input number: '))
# temp = 1
# sum = 1
# while temp <= n:
#     sum = sum * temp
#     temp += 1
# print('Product of number: ', sum)

# ======================================================================================

# Задача №11. Решение в группах
# Дано натуральное число A > 1. Определите, каким по
# счету числом Фибоначчи оно является, то есть
# выведите такое число n, что φ(n)=A. Если А не
# является числом Фибоначчи, выведите число -1.
# Input: 5
# Output: 6

# a = int(input('Input number: '))
# count = 2
# f1 = 0
# f2 = 1
# for i in range(a+1) :
#     f = f1 + f2
#     f1 = f2
#     f2 = f
#     count += 1
#     if f == a :
#         print(count)
#         break
#     elif f > a :
#         print(-1)
#         break

# ==================================================================================

# Задача №15. Решение в группах

# Пользователь вводит одно число N – количество
# арбузов. Вторая строка содержит N чисел,
# записанных на новой строчке каждое. Здесь каждое
# число – это масса соответствующего арбуза
# Input: 5 -> 5 1 6 5 9
# Output: 1 9

# a = int(input('Input number of watermelons: '))
# max = 0
# min = 0
# for i in range(a) :
#     b = int(input(f'Input weight of watermelon {i + 1}: '))
#     if max == 0 :
#         max = b
#         min = b
#     elif max < b :
#         max = b
#     elif min > b :
#         min = b 
# print(min, max)

# ==============================================================================

