# Задача 10: 
# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть


# n = int(input('input quantity of coins: '))
# count = 0
# for m in range(n) :
#     m = int(input('0 or 1: '))
#     if m == 0 :
#         count += 1
# if n // 2 < count :
#     print(n - count)
# else : print(count)

# ====================================================================================================================

# Задача 12: 
# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), 
# а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.

# x = int(input('Input"X" (<=1000): '))
# y = int(input('Input "Y" (<=1000): '))
# if x <= 1000 :
#     if y <= 1000:
        
# x = s - y
# x = p / y
# s - y = p / y
# p = y(s - y)
# -(y^2) + ys - p = 0






# =====================================================================================================================
# Задача 14: 
# Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

# n = int(input('input N: '))
# a = 2
# count = 1
# sum = 1

# while sum < n:
#     print(sum, end=' ')
#     sum = a ** count
#     count += 1


    

    