# Задача 30: Заполните массив элементами арифметической
# прогрессии. Её первый элемент, разность и количество
# элементов нужно ввести с клавиатуры. Формула для
# получения n-го члена прогрессии: 
# a_n = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# Ввод: 7 2 5
# Вывод: 7 9 11 13 15


# progr = int(input('input first el: '))
# step = int(input('input to step of prog: '))
# quant = int(input('input quantity el: '))
# spisok = []
# spisok.append(progr)
# for i in range(0, quant - 1) :
#     progr += step
#     spisok.append(progr)
    
# print(spisok)
    
    
    
    








# ===================================================================================

# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]



min = int(input('input min num: '))
max = int(input('input max num: '))
spisok = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
spisok2 = []
for i in range(len(spisok)):
    if spisok[i] >= min and spisok[i] <= max:
        spisok2.append(i)
print(spisok2)

